#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/b65ff531-d7b3-45e3-ac1f-05845b5898e5/resourceGroups/gitopsdemo-rg]
azurerm_service_plan.main: Refreshing state... [id=/subscriptions/b65ff531-d7b3-45e3-ac1f-05845b5898e5/resourceGroups/gitopsdemo-rg/providers/Microsoft.Web/serverfarms/gitopsdemo-asp]
azurerm_storage_account.main: Refreshing state... [id=/subscriptions/b65ff531-d7b3-45e3-ac1f-05845b5898e5/resourceGroups/gitopsdemo-rg/providers/Microsoft.Storage/storageAccounts/gitopsdemostorageacct]
azurerm_linux_function_app.main: Refreshing state... [id=/subscriptions/b65ff531-d7b3-45e3-ac1f-05845b5898e5/resourceGroups/gitopsdemo-rg/providers/Microsoft.Web/sites/gitopsdemo-function]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_application_insights.main will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "gitopsdemo-appinsights"
      + resource_group_name                   = "gitopsdemo-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # azurerm_linux_function_app.main will be updated in-place
  ~ resource "azurerm_linux_function_app" "main" {
      ~ app_settings                      = {} -> (known after apply)
        id                                = "/subscriptions/b65ff531-d7b3-45e3-ac1f-05845b5898e5/resourceGroups/gitopsdemo-rg/providers/Microsoft.Web/sites/gitopsdemo-function"
        name                              = "gitopsdemo-function"
        tags                              = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pushed by: @benbhall, Action: `pull_request`*